In [1]:
import sys
#!{sys.executable} -m pip install  kagglehub

# project Dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import kagglehub

# Download latest version of kagglehub
path = kagglehub.dataset_download("jacksoncrow/stock-market-dataset")
print("Path to dataset files:", path)


#import scipy.stats as st
#import time
#from scipy.stats import linregress
#from sklearn import datasets


#import random
#import requests
#from pprint import pprint
#from pathlib import Path
#import json

# Import the API key
#from config import Nasdaq_api_key

Path to dataset files: C:\Users\lord1\.cache\kagglehub\datasets\jacksoncrow\stock-market-dataset\versions\2

In [2]:
data = pd.read_csv("http://www.nasdaqtrader.com/dynamic/SymDir/nasdaqtraded.txt", sep='|')
data_clean = data[data['Test Issue'] == 'N']
symbols = data_clean['NASDAQ Symbol'].tolist()
print('total number of symbols traded = {}'.format(len(symbols)))

total number of symbols traded = 11101

In [3]:
# Took Tmobile stock data and read it into pandas

In [4]:
Tmobile_STK = pd.read_csv(r"\Users\lord1\.cache\kagglehub\datasets\jacksoncrow\stock-market-dataset\versions\2\stocks/TMUS.csv")
Tmobile_STK

,Date,Open,High,Low,Close,Adj Close,Volume
0,2007-04-19,50.200001,55.220001,49.000000,54.799999,44.560043,15862400
1,2007-04-20,54.799999,57.599998,54.200001,57.099998,46.430264,3054700
2,2007-04-23,57.200001,57.880001,56.580002,57.500000,46.755520,1876400
3,2007-04-24,57.020000,58.799999,57.020000,58.400002,47.487347,1532900
4,2007-04-25,59.099998,59.500000,57.020000,57.220001,46.527843,1225300
...,...,...,...,...,...,...,...
3257,2020-03-26,80.000000,84.989998,79.730003,84.629997,84.629997,4821300
3258,2020-03-27,82.540001,83.900002,81.019997,81.720001,81.720001,4309600
3259,2020-03-30,82.290001,83.860001,81.239998,83.120003,83.120003,5625200
3260,2020-03-31,83.040001,84.750000,81.980003,83.900002,83.900002,6920600
3261,2020-04-01,82.989998,86.709999,82.699997,85.129997,85.129997,11018000

In [5]:
# Drop the follwing columns from the Tmobile_STK: Low, close, Volume
Tmobile_STK_Clean= Tmobile_STK.drop(columns=['Open', 'High', 'Low', 'Close', 'Volume'])
Tmobile_STK_Clean.head()

         Date  Adj Close
0  2007-04-19  44.560043
1  2007-04-20  46.430264
2  2007-04-23  46.755520
3  2007-04-24  47.487347
4  2007-04-25  46.527843

In [6]:
# Took Verizon stock data and read it into pandas
Verizon_STK = pd.read_csv(r"\Users\lord1\.cache\kagglehub\datasets\jacksoncrow\stock-market-dataset\versions\2\stocks/VZ.csv")
Verizon_STK.head()

         Date      Open      High       Low     Close  Adj Close   Volume
0  1983-11-21  7.939334  7.953386  7.377257  7.897178   0.301449  5020600
1  1983-11-22  7.897178  8.009593  7.855022  7.869074   0.300376  2666700
2  1983-11-23  7.869074  7.897178  7.784762  7.826919   0.298767  1151900
3  1983-11-25  7.826919  7.840971  7.742607  7.742607   0.295549  1771800
4  1983-11-28  7.700451  7.700451  7.503724  7.531828   0.287503  2367800

In [7]:
# Drop the follwing columns from the Tmobile_STK: Low, close, Volume
Verizon_STK_Clean = Verizon_STK.drop(columns=['Open', 'High', 'Low', 'Close', 'Volume'])
Verizon_STK_Clean.head()

         Date  Adj Close
0  1983-11-21   0.301449
1  1983-11-22   0.300376
2  1983-11-23   0.298767
3  1983-11-25   0.295549
4  1983-11-28   0.287503

In [8]:
# Merged the Tmobile_STK_Clean dataset with Verizon_STK_Clean on "Date" 
combined_stock_df = pd.merge(Tmobile_STK_Clean, Verizon_STK_Clean,
                                 how='inner', on='Date')
combined_stock_df.head()

         Date  Adj Close_x  Adj Close_y
0  2007-04-19    44.560043    18.700361
1  2007-04-20    46.430264    18.899786
2  2007-04-23    46.755520    18.720304
3  2007-04-24    47.487347    18.745234
4  2007-04-25    46.527843    18.770159

In [9]:
# Renamed "Adj Close_x" to "Tmobile_Adj_Close and "Adj Close_y" to "Verizon_Adj_Close".

combined_stock_df = combined_stock_df.rename(columns={"Adj Close_x":"Tmobile_Adj_Close"})

combined_stock_df = combined_stock_df.rename(columns={"Adj Close_y":"Verizon_Adj_Close"})

combined_stock_df.head()

         Date  Tmobile_Adj_Close  Verizon_Adj_Close
0  2007-04-19          44.560043          18.700361
1  2007-04-20          46.430264          18.899786
2  2007-04-23          46.755520          18.720304
3  2007-04-24          47.487347          18.745234
4  2007-04-25          46.527843          18.770159

In [10]:
# Took AT&T stock data and read it into pandas
ATT_STK = pd.read_csv(r"\Users\lord1\.cache\kagglehub\datasets\jacksoncrow\stock-market-dataset\versions\2\stocks/T.csv")
ATT_STK.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
9161,2020-03-26,28.680000,30.959999,28.680000,30.600000,30.600000,64038000
9162,2020-03-27,29.690001,30.820000,29.219999,29.840000,29.840000,46386000
9163,2020-03-30,29.900000,30.410000,29.480000,30.230000,30.230000,41629900
9164,2020-03-31,30.040001,30.129999,29.049999,29.150000,29.150000,69813400
9165,2020-04-01,28.379999,28.580000,27.700001,28.049999,28.049999,54628900

In [11]:
# Drop the follwing columns from the AT&T_STK: Low, close, Volume
ATT_STK_Clean = ATT_STK.drop(columns=['Open', 'High', 'Low', 'Close', 'Volume'])
ATT_STK_Clean.tail()

            Date  Adj Close
9161  2020-03-26  30.600000
9162  2020-03-27  29.840000
9163  2020-03-30  30.230000
9164  2020-03-31  29.150000
9165  2020-04-01  28.049999

In [12]:
# Merged the combined_stock_df dataset with AT&T dataset on "Date" 
combined_stock_df = pd.merge(combined_stock_df, ATT_STK_Clean, how="inner", on="Date")
combined_stock_df.head()

         Date  Tmobile_Adj_Close  Verizon_Adj_Close  Adj Close
0  2007-04-19          44.560043          18.700361  19.732235
1  2007-04-20          46.430264          18.899786  20.013330
2  2007-04-23          46.755520          18.720304  19.963135
3  2007-04-24          47.487347          18.745234  19.626814
4  2007-04-25          46.527843          18.770159  19.646889

In [13]:
# Renamed "Adj Close to "ATT_Adj_Close"".
combined_stock_df = combined_stock_df.rename(columns={"Adj Close":"ATT_Adj_Close"})
combined_stock_df.head()

         Date  Tmobile_Adj_Close  Verizon_Adj_Close  ATT_Adj_Close
0  2007-04-19          44.560043          18.700361      19.732235
1  2007-04-20          46.430264          18.899786      20.013330
2  2007-04-23          46.755520          18.720304      19.963135
3  2007-04-24          47.487347          18.745234      19.626814
4  2007-04-25          46.527843          18.770159      19.646889

In [14]:
#Ready for plotting!!!